# ------------------------------------------- 2 -----------------------------
# Создайте модуль с функцией внутри.
# Функция принимает на вход три целых числа:
# нижнюю и верхнюю границу и количество попыток.
# Внутри генерируется случайное число в указанных
# границах и пользователь должен угадать
# его за заданное число попыток.
# Функция выводит подсказки “больше” и “меньше”.
# Если число угадано, возвращается истина, а если попытки исчерпаны - ложь.

from random import randint

from HW6_Pac import guess_game

result = guess_game.guess()
print(result)

if __name__ == '__main__':
    print(guess())
