# ------------------------------------------- 3 -----------------------------
# Улучшаем задачу 2. Добавьте возможность запуска
# функции “угадайки” из модуля в командной строке терминала.
# Строка должна принимать от 1 до 3 аргументов:
# параметры вызова функции. Для преобразования строковых
# аргументов командной строки в числовые
# параметры используйте генераторное выражение.

from HW6_Pac import guess_game



result = guess_game.guess()
print(result)

if __name__ == '__main__':
    name, *param = argv
    print(guess(*(int(n) for n in param)))
