# ------------------------------------------- 4 -----------------------------
# Создайте модуль с функцией внутри.
# Функция получает на вход загадку,
# список с возможными вариантами отгадок и количество
# попыток на угадывание. Программа возвращает номер попытки,
# с которой была отгадана загадка или ноль, если попытки исчерпаны.

from HW6_Pac import riddles

riddles.storage()

if __name__ == '__main__':
    result = secrets('Зимой и летом одним цветом', ['ель', 'ёлка', 'сосна'])
    print(f'Угадал с {result} попытки' if result > 0 else 'Не угадал')
    secrets()
